### 1.Create a database called temp_db. Open a cursor to this newly created database.

In [1]:
import sqlite3
con=sqlite3.connect('temp_db')
cur=con.cursor()

### 2.In the database temp_db created in Q.No.1, create a table called emp with the attributes empno, ename, salary and deptno\

In [2]:
cur.execute('create table if not exists emp(empno INTEGER,ename TEXT,salary INTEGER,deptno INTEGER)')

### 3.In the emp table created in Q.No. 2, insert any five records.

In [3]:
def insert(empno,ename,salary,deptno):
    cur.execute('insert into emp values(?,?,?,?)',(empno,ename,salary,deptno))
    con.commit()

In [4]:
insert(101,'Vinay Sai',15000,10)
insert(102,'Pravalika',20000,20)
insert(103,'Hari',24000,30)
insert(104,'Hema',25000,10)
insert(105,'Manish',30000,50)

### 4.From the emp table, display all the records

In [5]:
def view():
    con=sqlite3.connect('temp_db')
    cur=con.cursor()
    cur.execute('select * from emp')
    rows=cur.fetchall()
    con.close()
    return rows

In [6]:
view()

[(101, 'Vinay Sai', 15000, 10),
 (102, 'Pravalika', 20000, 20),
 (103, 'Hari', 24000, 30),
 (104, 'Hema', 25000, 10),
 (105, 'Manish', 30000, 50)]

### 5.From the emp table, display the records of only those employees whose salary is greater than 15000 and who belong to deptno 10

In [7]:
def view1():
    con=sqlite3.connect('temp_db')
    cur=con.cursor()
    cur.execute('select * from emp where salary>15000 and deptno==10')
    rows=cur.fetchall()
    con.close()
    return rows

In [8]:
view1()

[(104, 'Hema', 25000, 10)]

### 6.From the emp table, display the records of only those employees whose salary lies between 20000 and 25000 and who do not belong to the deptno 10.

In [9]:
def view2():
    con=sqlite3.connect('temp_db')
    cur=con.cursor()
    cur.execute('select * from emp where salary>20000 and salary<25000 and deptno!=10')
    rows=cur.fetchall()
    con.close()
    return rows

In [10]:
view2()

[(103, 'Hari', 24000, 30)]

### 7.From the emp table, display the records of only those employees whose name begins with M.

In [11]:
def viewM():
    con=sqlite3.connect('temp_db')
    cur=con.cursor()
    cur.execute('select * from emp where ename LIKE "M%" ')
    rows=cur.fetchall()
    con.close()
    return rows

In [12]:
viewM()

[(105, 'Manish', 30000, 50)]

### 8.In the emp table, delete the records of those employees who belong to deptno 30

In [13]:
import sqlite3
def delete():
    con=sqlite3.connect('temp_db')
    cur=con.cursor()
    cur.execute('delete from emp where deptno==30')
    rows=cur.fetchall()
    con.commit()
    con.close()
    return rows

In [14]:
delete()

[]

In [15]:
view()

[(101, 'Vinay Sai', 15000, 10),
 (102, 'Pravalika', 20000, 20),
 (104, 'Hema', 25000, 10),
 (105, 'Manish', 30000, 50)]

### 9.In the emp table, update the salary of an employee by 10 % by accepting the empno from the user.

In [16]:
def update(emp):
    con=sqlite3.connect("temp_db")
    cur=con.cursor()
    cur.execute("update emp set salary=salary+(salary*10/100) where empno=?",(emp,))
    con.commit()
    con.close()

In [17]:
update(101)

In [18]:
view()

[(101, 'Vinay Sai', 16500, 10),
 (102, 'Pravalika', 20000, 20),
 (104, 'Hema', 25000, 10),
 (105, 'Manish', 30000, 50)]

### 10.Delete the emp table.

In [19]:
def drop():
    con = sqlite3.connect('temp_db')
    cur = con.cursor()
    cur.execute("DROP TABLE emp")
    con.commit()
    con.close

In [20]:
drop()

In [21]:
view()

OperationalError: no such table: emp